Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 384, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 256, 384, 32) 320         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 256, 384, 32) 128         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 256, 384, 32) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 384, 32) 9248        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 384, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 384, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 192, 32) 9248        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 192, 32) 128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 192, 32) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 192, 64) 18496       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 192, 64) 256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 192, 64) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 192, 64) 36928       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 192, 64) 256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 192, 64) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 96, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 96, 64)   256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 96, 64)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 96, 128)  73856       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 64, 96, 128)  512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64, 96, 128)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 96, 128)  147584      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 96, 128)  512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 96, 128)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 48, 128)  147584      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 48, 128)  512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 48, 128)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 48, 256)  295168      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 48, 256)  1024        conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 48, 256)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 48, 256)  590080      activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 48, 256)  1024        conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 48, 256)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 24, 256)  590080      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 24, 256)  1024        conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 24, 256)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 24, 512)  1180160     activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 24, 512)  2048        conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 24, 512)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 24, 512)  2359808     activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 24, 512)  2048        conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 24, 512)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 16, 512)      0           activation_13[0][0]              
__________________________________________________________________________________________________
conv1d_transpose (Conv1DTranspo (None, 32, 256)      262400      global_max_horizontal_pooling2d[0
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 32, 256)      0           activation_10[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 512)      0           conv1d_transpose[0][0]           
                                                                 global_max_horizontal_pooling2d_1
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 512)      0           concatenate[0][0]                
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 32, 256)      393472      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 256)      1024        conv1d[0][0]                     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 256)      0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 32, 256)      196864      activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 32, 256)      1024        conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 32, 256)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_transpose_1 (Conv1DTrans (None, 64, 128)      65664       activation_16[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 64, 128)      0           activation_7[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 256)      0           conv1d_transpose_1[0][0]         
                                                                 global_max_horizontal_pooling2d_2
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 256)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 64, 128)      98432       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 128)      512         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 64, 128)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 64, 128)      49280       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 128)      512         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 64, 128)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_transpose_2 (Conv1DTrans (None, 128, 64)      16448       activation_18[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 128, 64)      0           activation_4[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128)     0           conv1d_transpose_2[0][0]         
                                                                 global_max_horizontal_pooling2d_3
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 128)     0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 128, 64)      24640       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 64)      256         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 64)      0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 128, 64)      12352       activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 64)      256         conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 64)      0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_transpose_3 (Conv1DTrans (None, 256, 32)      4128        activation_20[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 256, 32)      0           activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 64)      0           conv1d_transpose_3[0][0]         
                                                                 global_max_horizontal_pooling2d_4
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 256, 64)      0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 256, 32)      6176        dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 256, 32)      128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 256, 32)      0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 256, 32)      3104        activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 256, 32)      128         conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 256, 32)      0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 256, 1)       33          activation_22[0][0]              
==================================================================================================
Total params: 6,642,177
Trainable params: 6,635,329
Non-trainable params: 6,848
__________________________________________________________________________________________________
