Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 384, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 256, 384, 32) 320         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 256, 384, 32) 128         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 256, 384, 32) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 384, 32) 9248        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 384, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 384, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 192, 32) 0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 192, 64) 18496       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 192, 64) 256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 192, 64) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 192, 64) 36928       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 192, 64) 256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 192, 64) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 96, 64)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 96, 128)  73856       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 96, 128)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 64, 96, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 96, 128)  147584      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 96, 128)  512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 96, 128)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 48, 128)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 48, 256)  819456      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 48, 256)  1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 48, 256)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 8, 12, 256)   0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 12, 512)   1180160     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 12, 512)   2048        conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 12, 512)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 12, 512)   2359808     activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 12, 512)   2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 12, 512)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 8, 512)       0           activation_8[0][0]               
__________________________________________________________________________________________________
up_sampling1d (UpSampling1D)    (None, 32, 512)      0           global_max_horizontal_pooling2d[0
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 32, 256)      0           activation_6[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 768)      0           up_sampling1d[0][0]              
                                                                 global_max_horizontal_pooling2d_1
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32, 768)      0           concatenate[0][0]                
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 32, 256)      983296      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 256)      1024        conv1d[0][0]                     
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 256)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 32, 256)      65792       activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 256)      1024        conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 256)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
up_sampling1d_1 (UpSampling1D)  (None, 64, 256)      0           activation_10[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 64, 128)      0           activation_5[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 384)      0           up_sampling1d_1[0][0]            
                                                                 global_max_horizontal_pooling2d_2
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 384)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 64, 128)      147584      dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 128)      512         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 128)      0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 64, 128)      49280       activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64, 128)      512         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 64, 128)      0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 64, 128)      16512       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 64, 128)      512         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 64, 128)      0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
up_sampling1d_2 (UpSampling1D)  (None, 128, 128)     0           activation_13[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 128, 64)      0           activation_3[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 192)     0           up_sampling1d_2[0][0]            
                                                                 global_max_horizontal_pooling2d_3
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 192)     0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 128, 128)     73856       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 128, 128)     512         conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 128, 128)     49280       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 128, 128)     512         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 128, 128)     16512       activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 128)     512         conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
up_sampling1d_3 (UpSampling1D)  (None, 256, 128)     0           activation_16[0][0]              
__________________________________________________________________________________________________
global_max_horizontal_pooling2d (None, 256, 32)      0           activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 160)     0           up_sampling1d_3[0][0]            
                                                                 global_max_horizontal_pooling2d_4
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 256, 160)     0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 256, 128)     61568       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 256, 128)     512         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 256, 128)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 256, 128)     49280       activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 256, 128)     512         conv1d_9[0][0]                   
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 256, 128)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 256, 128)     16512       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 256, 128)     512         conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 256, 128)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
last_conv (Conv1D)              (None, 256, 1)       129         activation_19[0][0]              
==================================================================================================
Total params: 6,189,025
Trainable params: 6,182,241
Non-trainable params: 6,784
__________________________________________________________________________________________________
